[CorpseSynthoid X2ItemTemplate]
FriendlyName="合成体碎片"
FriendlyNamePlural="合成体碎片"
BriefSummary="这些“合成生物”的动力和运动系统与已故的沈博士设计的机器人战斗原型非常相似，但其计算机系统的内部运作显然有着截然不同的来源。" 

[AutopsyAdventSynthoid X2TechTemplate]
DisplayName="变种人合成体分解"
Summary="这些机械化单位似乎是已故的沈博士的机械工作与入侵前“联合公司”正在进行的自主机器工作的结合。似乎 ADVENT 选择了该公司的科学家，并利用他们来进一步开发他们。如果我们把这些遗骸拆开，我们可能会找到一些东西来为自己所用。" 
CodeName="聚合"
LongDescription="从我们最初的细分来看，合成体设计似乎是人类和外星技术的无缝结合，包括与人类制造的EWR相比，对内置喷气背包进行了重大改进。虽然不幸的是，我们无法在我们这边复制这些改进，但我们能够设计出一种方法来为我们的背心创造更好的烧蚀插入物：它本身可能没有多大意义，但这可能意味着在适当的情况下，在该领域的生与死的区别。沈"
AlertString="变种人合成体"


[ADVSynthoid_M1 X2CharacterTemplate]
strCharacterName="变种人合成体"

[ADVSynthoid_M2 X2CharacterTemplate]
strCharacterName="高级变种人合成体"

[ADVSynthoid_M3 X2CharacterTemplate]
strCharacterName="精英合成体"


;Abilities
[RM_SynthoidImmunities X2AbilityTemplate]
LocFriendlyName="机械底盘"
LocLongDescription="该单位对火和毒物伤害免疫。"
LocHelpText="该单位对火和毒物伤害免疫。"

[RM_SyntheticReflexes X2AbilityTemplate]
LocFriendlyName="合成反射"
LocLongDescription="每个回合，对合成人的第一反应射击都未命中。"
LocHelpText="每个回合，对合成人的第一反应射击都未命中。"
LocFlyOverText="合成反射"


[RM_Launch X2AbilityTemplate]
LocFriendlyName="发射"
LocLongDescription="合成体内置的推进喷气机使其能够将自己发射到新位置。"
LocHelpText="跳转到新位置。绕过所有守望先锋和反应火力。"
LocFlyOverText="发射"